wisdpi/lighting-controller/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA


# Arduino wpdlc01
# ---------------
wpdlc01.name=WP-DLC01
wpdlc01.vid.0=0x0424
wpdlc01.pid.0=0x804f
wpdlc01.vid.1=0x0424
wpdlc01.pid.1=0x004f
wpdlc01.upload_port.0.vid=0x0424
wpdlc01.upload_port.0.pid=0x804f
wpdlc01.upload_port.1.vid=0x0424
wpdlc01.upload_port.1.pid=0x004f
wpdlc01.upload_port.2.board=wpdlc01

wpdlc01.upload.tool=bossac
wpdlc01.upload.tool.default=bossac
wpdlc01.upload.tool.network=arduino_ota
wpdlc01.upload.protocol=sam-ba
wpdlc01.upload.maximum_size=262144
wpdlc01.upload.maximum_data_size=32768
wpdlc01.upload.use_1200bps_touch=true
wpdlc01.upload.wait_for_upload_port=true
wpdlc01.upload.native_usb=true
wpdlc01.build.mcu=cortex-m0plus
wpdlc01.build.f_cpu=48000000L
wpdlc01.build.usb_product="WisdPi Lighting Strip"
wpdlc01.build.usb_manufacturer="WisdPi LLC"
wpdlc01.build.board=WISDPI_WPDLC01
wpdlc01.build.core=arduino
wpdlc01.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags}
wpdlc01.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
wpdlc01.build.openocdscript=openocd_scripts/wpdlc01.cfg
wpdlc01.build.variant=wpdlc01
wpdlc01.build.vid=0x0424
wpdlc01.build.pid=0x804f
wpdlc01.bootloader.tool=openocd
wpdlc01.bootloader.tool.default=openocd
wpdlc01.bootloader.file=wpdlc01/samd21_sam_ba_arduino_wpdlc01o.bin